app/controllers/users_controller.rb

	def create
		user = User.new(permit_params)

		if user.save
---
INSERT INTO "users" ("name", "description", "phone_number", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "deepika shanmugam"], ["description", "testing the data"], ["phone_number", "9869562356"], ["created_at", "2023-11-28 06:56:25.313719"], ["updated_at", "2023-11-28 06:56:25.313719"]]

	def update
		user_data = User.find_by(id: params[:id])

		if user_data
			WebhookJob.perform_now(WebhookEndpointService.endpoint_url, user_data.as_json, user_data.description)

			user_data.update(permit_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "deepika S"], ["description", "testing the data"], ["updated_at", "2023-11-28 14:30:09.416827"], ["id", 12]]